docs/benchmarks/20260424_000657_compare_c500/run_a_raw.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /script.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * booking_stress: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 51525 complete and 0 interrupted iterations
booking_stress   [   2% ] 500 VUs  0m01.0s/1m0s

running (0m02.0s), 500/500 VUs, 105289 complete and 0 interrupted iterations
booking_stress   [   3% ] 500 VUs  0m02.0s/1m0s

running (0m03.0s), 500/500 VUs, 164055 complete and 0 interrupted iterations
booking_stress   [   5% ] 500 VUs  0m03.0s/1m0s

running (0m04.0s), 500/500 VUs, 221054 complete and 0 interrupted iterations
booking_stress   [   7% ] 500 VUs  0m04.0s/1m0s

running (0m05.0s), 500/500 VUs, 278425 complete and 0 interrupted iterations
booking_stress   [   8% ] 500 VUs  0m05.0s/1m0s

running (0m06.0s), 500/500 VUs, 337661 complete and 0 interrupted iterations
booking_stress   [  10% ] 500 VUs  0m06.0s/1m0s

running (0m07.0s), 500/500 VUs, 391064 complete and 0 interrupted iterations
booking_stress   [  12% ] 500 VUs  0m07.0s/1m0s

running (0m08.0s), 500/500 VUs, 447750 complete and 0 interrupted iterations
booking_stress   [  13% ] 500 VUs  0m08.0s/1m0s

running (0m09.0s), 500/500 VUs, 506184 complete and 0 interrupted iterations
booking_stress   [  15% ] 500 VUs  0m09.0s/1m0s

running (0m10.0s), 500/500 VUs, 553840 complete and 0 interrupted iterations
booking_stress   [  17% ] 500 VUs  0m10.0s/1m0s

running (0m11.0s), 500/500 VUs, 604375 complete and 0 interrupted iterations
booking_stress   [  18% ] 500 VUs  0m11.0s/1m0s

running (0m12.0s), 500/500 VUs, 656100 complete and 0 interrupted iterations
booking_stress   [  20% ] 500 VUs  0m12.0s/1m0s

running (0m13.0s), 500/500 VUs, 706245 complete and 0 interrupted iterations
booking_stress   [  22% ] 500 VUs  0m13.0s/1m0s

running (0m14.0s), 500/500 VUs, 756552 complete and 0 interrupted iterations
booking_stress   [  23% ] 500 VUs  0m14.0s/1m0s

running (0m15.0s), 500/500 VUs, 807838 complete and 0 interrupted iterations
booking_stress   [  25% ] 500 VUs  0m15.0s/1m0s

running (0m16.0s), 500/500 VUs, 857835 complete and 0 interrupted iterations
booking_stress   [  27% ] 500 VUs  0m16.0s/1m0s

running (0m17.0s), 500/500 VUs, 909713 complete and 0 interrupted iterations
booking_stress   [  28% ] 500 VUs  0m17.0s/1m0s

running (0m18.0s), 500/500 VUs, 961824 complete and 0 interrupted iterations
booking_stress   [  30% ] 500 VUs  0m18.0s/1m0s

running (0m19.0s), 500/500 VUs, 1014309 complete and 0 interrupted iterations
booking_stress   [  32% ] 500 VUs  0m19.0s/1m0s

running (0m20.0s), 500/500 VUs, 1063377 complete and 0 interrupted iterations
booking_stress   [  33% ] 500 VUs  0m20.0s/1m0s

running (0m21.0s), 500/500 VUs, 1114166 complete and 0 interrupted iterations
booking_stress   [  35% ] 500 VUs  0m21.0s/1m0s

running (0m22.0s), 500/500 VUs, 1164152 complete and 0 interrupted iterations
booking_stress   [  37% ] 500 VUs  0m22.0s/1m0s

running (0m23.0s), 500/500 VUs, 1209996 complete and 0 interrupted iterations
booking_stress   [  38% ] 500 VUs  0m23.0s/1m0s

running (0m24.0s), 500/500 VUs, 1258518 complete and 0 interrupted iterations
booking_stress   [  40% ] 500 VUs  0m24.0s/1m0s

running (0m25.0s), 500/500 VUs, 1309401 complete and 0 interrupted iterations
booking_stress   [  42% ] 500 VUs  0m25.0s/1m0s

running (0m26.0s), 500/500 VUs, 1357119 complete and 0 interrupted iterations
booking_stress   [  43% ] 500 VUs  0m26.0s/1m0s

running (0m27.0s), 500/500 VUs, 1408098 complete and 0 interrupted iterations
booking_stress   [  45% ] 500 VUs  0m27.0s/1m0s

running (0m28.0s), 500/500 VUs, 1461368 complete and 0 interrupted iterations
booking_stress   [  47% ] 500 VUs  0m28.0s/1m0s

running (0m29.0s), 500/500 VUs, 1511903 complete and 0 interrupted iterations
booking_stress   [  48% ] 500 VUs  0m29.0s/1m0s

running (0m30.0s), 500/500 VUs, 1563341 complete and 0 interrupted iterations
booking_stress   [  50% ] 500 VUs  0m30.0s/1m0s

running (0m31.0s), 500/500 VUs, 1612703 complete and 0 interrupted iterations
booking_stress   [  52% ] 500 VUs  0m31.0s/1m0s

running (0m32.0s), 500/500 VUs, 1660685 complete and 0 interrupted iterations
booking_stress   [  53% ] 500 VUs  0m32.0s/1m0s

running (0m33.0s), 500/500 VUs, 1712899 complete and 0 interrupted iterations
booking_stress   [  55% ] 500 VUs  0m33.0s/1m0s

running (0m34.0s), 500/500 VUs, 1761231 complete and 0 interrupted iterations
booking_stress   [  57% ] 500 VUs  0m34.0s/1m0s

running (0m35.0s), 500/500 VUs, 1812220 complete and 0 interrupted iterations
booking_stress   [  58% ] 500 VUs  0m35.0s/1m0s

running (0m36.0s), 500/500 VUs, 1865015 complete and 0 interrupted iterations
booking_stress   [  60% ] 500 VUs  0m36.0s/1m0s

running (0m37.0s), 500/500 VUs, 1915303 complete and 0 interrupted iterations
booking_stress   [  62% ] 500 VUs  0m37.0s/1m0s

running (0m38.0s), 500/500 VUs, 1966322 complete and 0 interrupted iterations
booking_stress   [  63% ] 500 VUs  0m38.0s/1m0s

running (0m39.0s), 500/500 VUs, 2010634 complete and 0 interrupted iterations
booking_stress   [  65% ] 500 VUs  0m39.0s/1m0s

running (0m40.0s), 500/500 VUs, 2060042 complete and 0 interrupted iterations
booking_stress   [  67% ] 500 VUs  0m40.0s/1m0s

running (0m41.0s), 500/500 VUs, 2109451 complete and 0 interrupted iterations
booking_stress   [  68% ] 500 VUs  0m41.0s/1m0s

running (0m42.0s), 500/500 VUs, 2158384 complete and 0 interrupted iterations
booking_stress   [  70% ] 500 VUs  0m42.0s/1m0s

running (0m43.0s), 500/500 VUs, 2208851 complete and 0 interrupted iterations
booking_stress   [  72% ] 500 VUs  0m43.0s/1m0s

running (0m44.0s), 500/500 VUs, 2258367 complete and 0 interrupted iterations
booking_stress   [  73% ] 500 VUs  0m44.0s/1m0s

running (0m45.0s), 500/500 VUs, 2308154 complete and 0 interrupted iterations
booking_stress   [  75% ] 500 VUs  0m45.0s/1m0s

running (0m46.0s), 500/500 VUs, 2361309 complete and 0 interrupted iterations
booking_stress   [  77% ] 500 VUs  0m46.0s/1m0s

running (0m47.0s), 500/500 VUs, 2413392 complete and 0 interrupted iterations
booking_stress   [  78% ] 500 VUs  0m47.0s/1m0s

running (0m48.0s), 500/500 VUs, 2464041 complete and 0 interrupted iterations
booking_stress   [  80% ] 500 VUs  0m48.0s/1m0s

running (0m49.0s), 500/500 VUs, 2515576 complete and 0 interrupted iterations
booking_stress   [  82% ] 500 VUs  0m49.0s/1m0s

running (0m50.0s), 500/500 VUs, 2568004 complete and 0 interrupted iterations
booking_stress   [  83% ] 500 VUs  0m50.0s/1m0s

running (0m51.0s), 500/500 VUs, 2617986 complete and 0 interrupted iterations
booking_stress   [  85% ] 500 VUs  0m51.0s/1m0s

running (0m52.0s), 500/500 VUs, 2670114 complete and 0 interrupted iterations
booking_stress   [  87% ] 500 VUs  0m52.0s/1m0s

running (0m53.0s), 500/500 VUs, 2720647 complete and 0 interrupted iterations
booking_stress   [  88% ] 500 VUs  0m53.0s/1m0s

running (0m54.0s), 500/500 VUs, 2770258 complete and 0 interrupted iterations
booking_stress   [  90% ] 500 VUs  0m54.0s/1m0s

running (0m55.0s), 500/500 VUs, 2818410 complete and 0 interrupted iterations
booking_stress   [  92% ] 500 VUs  0m55.0s/1m0s

running (0m56.0s), 500/500 VUs, 2867899 complete and 0 interrupted iterations
booking_stress   [  93% ] 500 VUs  0m56.0s/1m0s

running (0m57.0s), 500/500 VUs, 2917879 complete and 0 interrupted iterations
booking_stress   [  95% ] 500 VUs  0m57.0s/1m0s

running (0m58.0s), 500/500 VUs, 2970547 complete and 0 interrupted iterations
booking_stress   [  97% ] 500 VUs  0m58.0s/1m0s

running (0m59.0s), 500/500 VUs, 3019472 complete and 0 interrupted iterations
booking_stress   [  98% ] 500 VUs  0m59.0s/1m0s

running (1m00.0s), 500/500 VUs, 3068418 complete and 0 interrupted iterations
booking_stress   [ 100% ] 500 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=12.3ms


  █ TOTAL RESULTS 

    checks_total.......: 6141201 102337.973933/s
    checks_succeeded...: 58.14%  3570620 out of 6141201
    checks_failed......: 41.85%  2570581 out of 6141201

    ✓ setup event created
    ✓ status is 200 or 409
    ✗ booking accepted
      ↳  16% — ✓ 500019 / ✗ 2570581

    CUSTOM
    booking_duration...............: avg=6.82ms min=0s      med=6ms    max=83ms    p(90)=12ms    p(95)=16ms   
    business_errors................: 0.00%   0 out of 3070600

    HTTP
    http_req_duration..............: avg=4.73ms min=46.91µs med=3.61ms max=82.38ms p(90)=9.43ms  p(95)=12.3ms 
      { expected_response:true }...: avg=4.02ms min=46.91µs med=2.96ms max=51.81ms p(90)=7.92ms  p(95)=10.72ms
    http_req_failed................: 83.71%  2570581 out of 3070601
    http_reqs......................: 3070601 51168.995298/s

    EXECUTION
    iteration_duration.............: avg=9.52ms min=80.33µs med=8.04ms max=86.27ms p(90)=18.04ms p(95)=21.94ms
    iterations.....................: 3070600 51168.978634/s
    vus............................: 500     min=500                max=500
    vus_max........................: 500     min=500                max=500

    NETWORK
    data_received..................: 586 MB  9.8 MB/s
    data_sent......................: 531 MB  8.8 MB/s



running (1m00.0s), 000/500 VUs, 3070600 complete and 0 interrupted iterations
booking_stress ✓ [ 100% ] 500 VUs  1m0s